import { Container } from '@mui/material';
import React from 'react';

export default function HomePage() {
  return (
    <Container>
      <h1>Home Page</h1>
      <div>
        Цей додаток дозволяє користувачам переглядати новини з декількох джерел,
        зокрема з "The New York Times", "BBC News", "CNN" та "Al Jazeera". Для
        цього додаток використовує API від згаданих джерел новин. Користувач
        може вибрати джерела новин, які він хоче переглянути, а також може
        використовувати фільтри за категоріями новин та часовими рамками. Крім
        цього, користувач може зберігати новини, які його зацікавили, до
        закладок для подальшого перегляду. Даний додаток розроблений за
        допомогою фреймворка React та використовує мову програмування
        JavaScript. Це дозволяє додатку бути швидким та ефективним у
        використанні, а також дозволяє розробникам легко розширювати та
        покращувати функціональність додатку. Цей додаток може бути корисним для
        розробників, які хочуть поглибитися у вивчення розробки веб-додатків та
        роботи з API.
      </div>
    </Container>
  );
}
